use ssafydb;

-- 모든 사원의 모든 정보 검색.


-- 사원이 근무하는 부서의 부서번호 검색.


-- 사원이 근무하는 부서의 부서번호 검색.(중복제거)


-- 회사에 존재하는 모든 부서.


-- 모든 사원의 사번, 이름, 급여 검색.


-- 모든 사원의 사번, 이름, 급여, 급여 * 12 (연봉) 검색.


-- 모든 사원의 사번, 이름, 급여, 급여 * 12 (연봉), 커미션, 커미션포함 연봉 검색.


-- 모든 사원의 사번, 이름, 급여, 급여에 따른 등급표시 검색.
-- 급여에 따른 등급
--   15000 이상 “고액연봉“      
--   8000 이상 “평균연봉”      
--   8000 미만 “저액연봉＂


-- 부서번호가 50인 사원중 급여가 7000이상인 사원의
-- 사번, 이름, 급여, 부서번호


-- 근무 부서번호가 50, 60, 70에 근무하는 사원의 사번, 이름, 부서번호


-- 근무 부서번호가 50, 60, 70이 아닌 사원의 사번, 이름, 부서번호


-- 근무 부서번호가 50, 60, 70에 근무하는 사원의 사번, 이름, 부서번호


-- 근무 부서번호가 50, 60, 70이 아닌 사원의 사번, 이름, 부서번호 


-- 급여가 6000이상 10000이하인 사원의 사번, 이름, 급여


-- 근무 부서가 지정되지 않은(알 수 없는) 사원의 사번, 이름, 부서번호 검색.


-- 커미션을 받는 사원의 사번, 이름, 급여, 커미션


-- 이름에 'x'가 들어간 사원의 사번, 이름


-- 이름의 끝에서 3번째 자리에 'x'가 들어간 사원의 사번, 이름


-- 모든 사원의 사번, 이름, 급여
-- 단 급여순 정렬(내림차순)


-- 50, 60, 70에 근무하는 사원의 사번, 이름, 부서번호, 급여
-- 단, 부서별 정렬(오름차순) 후 급여순(내림차순) 검색

